#### 这一小节 我们来学习一下怎么修改 index 的名称

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
# Create a DataFrame
df= DataFrame(np.arange(12).reshape((3, 4)),
                 index=['joshua', 'ze', 'xiaoli'],
                 columns=['A', 'B', 'C', 'D'])

In [5]:
df

        A  B   C   D
joshua  0  1   2   3
ze      4  5   6   7
xiaoli  8  9  10  11

In [6]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.index

Index(['joshua', 'ze', 'xiaoli'], dtype='object')

In [8]:
# Use map to lowercase the city initials
df.index = df.index.map(str.lower)

In [9]:
# If you want to assign this to the actual index, you can use index
df.index = df.index.map(str.lower)

In [10]:
df

        A  B   C   D
joshua  0  1   2   3
ze      4  5   6   7
xiaoli  8  9  10  11

In [11]:
# str.title 会大写首写字母
df.rename(index = str.title, columns = str.lower)

        a  b   c   d
Joshua  0  1   2   3
Ze      4  5   6   7
Xiaoli  8  9  10  11

In [12]:
df.rename(columns={'A': 'Alpha'})

        Alpha  B   C   D
joshua      0  1   2   3
ze          4  5   6   7
xiaoli      8  9  10  11

In [13]:
df

        A  B   C   D
joshua  0  1   2   3
ze      4  5   6   7
xiaoli  8  9  10  11

In [14]:
# 如果想把修改应用于原来的表格，把 inplace=True
df.rename(index={'ny': 'NEW YORK CITY'}, inplace=True)
df

        A  B   C   D
joshua  0  1   2   3
ze      4  5   6   7
xiaoli  8  9  10  11